In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv('towmaterlabs.csv')

In [3]:
len(data)

266776

In [4]:
data.head(4)

,id,blood_group,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,mother_age,father_age,accepted
0,223723,O,Female,23,1,18.0,1,< 1 Year,No,29223.0,152.0,89,70,65,0
1,102674,AB-,Male,44,1,23.0,0,1-2 Year,Yes,28501.0,26.0,111,61,66,1
2,15567,AB+,Male,23,1,41.0,0,< 1 Year,Yes,32590.0,152.0,71,67,78,0
3,222937,O,Male,78,1,15.0,1,1-2 Year,No,2630.0,14.0,245,74,63,0

In [5]:
data.tail(4)

,id,blood_group,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,mother_age,father_age,accepted
266772,260914,AB+,Male,41,1,14.0,0,1-2 Year,Yes,31399.0,26.0,25,63,75,0
266773,214966,AB+,Male,44,1,3.0,0,1-2 Year,Yes,21292.0,26.0,36,73,70,0
266774,200722,B+,Male,38,1,30.0,1,1-2 Year,Yes,29448.0,26.0,117,62,76,0
266775,438772,O,Male,48,1,41.0,0,1-2 Year,Yes,39092.0,26.0,114,68,78,0

In [6]:
print(data['blood_group'],':',len(data['blood_group'].unique()),'labels')

0           O
1         AB-
2         AB+
3           O
4          B+
         ...
266771      O
266772    AB+
266773    AB+
266774     B+
266775      O
Name: blood_group, Length: 266776, dtype: object : 4 labels

In [7]:
data1=pd.get_dummies(data['blood_group'],drop_first=True)

In [8]:
data=pd.concat([data1,data],axis=1)

In [9]:
data.drop('blood_group',axis=1,inplace=True)

In [10]:
data.head(4)

,AB-,B+,O,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,mother_age,father_age,accepted
0,0,0,1,223723,Female,23,1,18.0,1,< 1 Year,No,29223.0,152.0,89,70,65,0
1,1,0,0,102674,Male,44,1,23.0,0,1-2 Year,Yes,28501.0,26.0,111,61,66,1
2,0,0,0,15567,Male,23,1,41.0,0,< 1 Year,Yes,32590.0,152.0,71,67,78,0
3,0,0,1,222937,Male,78,1,15.0,1,1-2 Year,No,2630.0,14.0,245,74,63,0

In [11]:
data.Region_Code.value_counts().sort_values(ascending=False).head(20)

28.0    74601
8.0     23650
46.0    13724
41.0    12804
15.0     9174
30.0     8612
29.0     7650
50.0     7122
3.0      6513
11.0     6509
36.0     6165
33.0     5406
47.0     5226
35.0     4859
6.0      4336
45.0     3968
37.0     3878
18.0     3611
48.0     3325
39.0     3300
Name: Region_Code, dtype: int64

In [12]:
top10=[x for x in data.Region_Code.value_counts().sort_values(ascending=False).head(10).index]

In [13]:
for label in top10:
    data[label]=np.where(data['Region_Code']==label,1,0)

In [14]:
data.head(3)

,AB-,B+,O,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,...,28.0,8.0,46.0,41.0,15.0,30.0,29.0,50.0,3.0,11.0
0,0,0,1,223723,Female,23,1,18.0,1,< 1 Year,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,102674,Male,44,1,23.0,0,1-2 Year,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,15567,Male,23,1,41.0,0,< 1 Year,...,0,0,0,1,0,0,0,0,0,0

In [15]:
data[['Region_Code']+top10].head(4)

   Region_Code  28.0  8.0  46.0  41.0  15.0  30.0  29.0  50.0  3.0  11.0
0         18.0     0    0     0     0     0     0     0     0    0     0
1         23.0     0    0     0     0     0     0     0     0    0     0
2         41.0     0    0     0     1     0     0     0     0    0     0
3         15.0     0    0     0     0     1     0     0     0    0     0

In [16]:
data.drop('Region_Code',axis=1,inplace=True)

In [17]:
data1=pd.get_dummies(data['Gender'],drop_first=True)
data=pd.concat([data1,data],axis=1)
data.drop('Gender',axis=1,inplace=True)

In [18]:
data.head(3)

,Male,AB-,B+,O,id,Age,Driving_License,Previously_Insured,Vehicle_Age,Vehicle_Damage,...,28.0,8.0,46.0,41.0,15.0,30.0,29.0,50.0,3.0,11.0
0,0,0,0,1,223723,23,1,1,< 1 Year,No,...,0,0,0,0,0,0,0,0,0,0
1,1,1,0,0,102674,44,1,0,1-2 Year,Yes,...,0,0,0,0,0,0,0,0,0,0
2,1,0,0,0,15567,23,1,0,< 1 Year,Yes,...,0,0,0,1,0,0,0,0,0,0

In [19]:
data.Vehicle_Age.value_counts().sort_values(ascending=False).head(20)

1-2 Year     140489
< 1 Year     115089
> 2 Years     11198
Name: Vehicle_Age, dtype: int64

In [20]:
data1=pd.get_dummies(data['Vehicle_Age'],drop_first=True)
data=pd.concat([data1,data],axis=1)
data.drop('Vehicle_Age',axis=1,inplace=True)

In [21]:
data['yn']=data['Age']

In [22]:

for i in range (len(data)):
    if(data['Vehicle_Damage'][i]=='No'):
        data['yn'][i]=0
    else:
        data['yn'][i]=1

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [23]:
data.head(4)

,< 1 Year,> 2 Years,Male,AB-,B+,O,id,Age,Driving_License,Previously_Insured,...,8.0,46.0,41.0,15.0,30.0,29.0,50.0,3.0,11.0,yn
0,1,0,0,0,0,1,223723,23,1,1,...,0,0,0,0,0,0,0,0,0,0
1,0,0,1,1,0,0,102674,44,1,0,...,0,0,0,0,0,0,0,0,0,1
2,1,0,1,0,0,0,15567,23,1,0,...,0,0,1,0,0,0,0,0,0,1
3,0,0,1,0,0,1,222937,78,1,1,...,0,0,0,1,0,0,0,0,0,0

In [24]:
data.to_csv('ksdj.csv')

In [25]:
data.drop('Vehicle_Damage',axis=1,inplace=True)

In [26]:
data['z']=data['< 1 Year']

In [27]:

data['< 1 Year']=data['id']

In [28]:

data['id']=data['z']

In [29]:
data.rename(columns={'id': 'tempid'}, inplace=True)

In [30]:

data.rename(columns={'< 1 Year':'id'}, inplace=True)

In [31]:

data.rename(columns={'tempid':'id'}, inplace=True)

In [32]:

data.drop('z',axis=1,inplace=True)

In [33]:
data.head()

,id,> 2 Years,Male,AB-,B+,O,id,Age,Driving_License,Previously_Insured,...,8.0,46.0,41.0,15.0,30.0,29.0,50.0,3.0,11.0,yn
0,223723,0,0,0,0,1,1,23,1,1,...,0,0,0,0,0,0,0,0,0,0
1,102674,0,1,1,0,0,0,44,1,0,...,0,0,0,0,0,0,0,0,0,1
2,15567,0,1,0,0,0,1,23,1,0,...,0,0,1,0,0,0,0,0,0,1
3,222937,0,1,0,0,1,0,78,1,1,...,0,0,0,1,0,0,0,0,0,0
4,32565,0,0,0,1,0,1,25,1,1,...,0,0,0,0,0,0,0,0,0,0

In [34]:
data.to_csv('practicefile.csv')

In [35]:
data['z']=data['accepted']
data['accepted']=data['yn']
data['yn']=data['z']
data.drop('z',axis=1,inplace=True)

In [36]:
data.rename(columns={'accepted':'temp'},inplace=True)
data.rename(columns={'yn':'accepted'},inplace=True)
data.rename(columns={'temp':'yn'},inplace=True)

In [37]:
data.to_csv('workable.csv')

In [38]:
x=data.iloc[:,1:26]
y=data.iloc[:,26]

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size = 0.1, random_state = 0)

In [41]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

In [42]:
from sklearn.neighbors import KNeighborsClassifier

In [43]:
model = KNeighborsClassifier(n_neighbors = 5)
model.fit(X_train,y_train)

KNeighborsClassifier()

In [46]:
prediction=model.predict(X_test)

In [80]:
from sklearn import svm

In [ ]:
poly = svm.SVC(kernel='poly', degree=3, C=1, decision_function_shape='ovo').fit(X_train, y_train)

In [47]:
print(prediction)

[0 0 0 ... 0 0 0]

In [49]:
type(prediction)

numpy.ndarray

In [57]:
c=0
for i in range(len(prediction)):
    if(prediction[i]==0):
        c+=1
print(c)

25022

In [144]:
import keras
from keras.models import Sequential
from keras.layers import Dense
from keras.layers import LeakyReLU,PReLU,ELU
from keras.layers import Dropout

In [145]:
classifier = Sequential()

In [146]:
classifier.add(Dense(output_dim = 6, init = 'he_uniform',activation='relu',input_dim = 25))
classifier.add(Dense(output_dim = 6, init = 'he_uniform',activation='relu'))

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", input_dim=25, units=6, kernel_initializer="he_uniform")`
  """Entry point for launching an IPython kernel.
C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="relu", units=6, kernel_initializer="he_uniform")`

In [147]:
classifier.add(Dense(activation="relu", input_dim=25, units=6, kernel_initializer="he_uniform"))
classifier.add(Dense(activation="relu", units=6, kernel_initializer="he_uniform"))

In [148]:
classifier.add(Dense(output_dim = 1, init = 'glorot_uniform', activation = 'sigmoid'))

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(activation="sigmoid", units=1, kernel_initializer="glorot_uniform")`
  """Entry point for launching an IPython kernel.

In [149]:
classifier.add(Dense(activation="sigmoid", units=1, kernel_initializer="glorot_uniform"))

In [150]:
classifier.compile(optimizer = 'Adamax', loss = 'binary_crossentropy', metrics = ['accuracy'])

In [151]:
model_history=classifier.fit(X_train, y_train,validation_split=0.12, batch_size = 10, nb_epoch = 4)

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.
  """Entry point for launching an IPython kernel.

Train on 211286 samples, validate on 28812 samples
Epoch 1/4
211286/211286 [==============================] - 40s 188us/step - loss: 0.3103 - accuracy: 0.8771 - val_loss: 0.2748 - val_accuracy: 0.8805
Epoch 2/4
211286/211286 [==============================] - 43s 205us/step - loss: 0.2789 - accuracy: 0.8771 - val_loss: 0.2719 - val_accuracy: 0.8805
Epoch 3/4
211286/211286 [==============================] - 39s 183us/step - loss: 0.2762 - accuracy: 0.8771 - val_loss: 0.2682 - val_accuracy: 0.8805
Epoch 4/4
211286/211286 [==============================] - 38s 182us/step - loss: 0.2740 - accuracy: 0.8771 - val_loss: 0.2664 - val_accuracy: 0.8805

In [82]:
print(model_history.history.keys())

dict_keys(['val_loss', 'val_accuracy', 'loss', 'accuracy'])

In [85]:

y_pred = classifier.predict(X_test)
y_pred = (y_pred > 0.5)

In [86]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)

In [87]:
print(cm)

[[46785     0]
 [ 6571     0]]

In [88]:
from sklearn.metrics import accuracy_score
score=accuracy_score(y_pred,y_test)

In [90]:
print(score)

0.8768460904115751

In [58]:
data2=pd.read_csv('test.csv')

In [59]:
data3=pd.get_dummies(data2['blood_group'],drop_first=True)
data2=pd.concat([data3,data2],axis=1)
data2.drop('blood_group',axis=1,inplace=True)

In [60]:
data2.head(3)

,AB-,B+,O,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,mother_age,father_age
0,0,1,0,485035,Female,21,1,8.0,0,1-2 Year,Yes,43500.0,157.0,266,64,62
1,0,0,1,278306,Male,53,1,2.0,0,1-2 Year,Yes,33547.0,26.0,119,76,79
2,0,0,0,478061,Female,23,1,30.0,1,< 1 Year,No,41650.0,152.0,84,61,77

In [61]:
data2.Region_Code.value_counts().sort_values(ascending=False).head(20)

28.0    31814
8.0     10227
46.0     6025
41.0     5459
15.0     4134
30.0     3579
29.0     3415
50.0     3121
3.0      2738
11.0     2723
36.0     2632
33.0     2248
47.0     2210
35.0     2083
6.0      1944
45.0     1637
37.0     1623
18.0     1542
14.0     1406
48.0     1356
Name: Region_Code, dtype: int64

In [62]:
top10=[x for x in data2.Region_Code.value_counts().sort_values(ascending=False).head(10).index]
for label in top10:
    data2[label]=np.where(data2['Region_Code']==label,1,0)

In [63]:
data2.drop('Region_Code',axis=1,inplace=True)

In [64]:
data3=pd.get_dummies(data2['Gender'],drop_first=True)
data2=pd.concat([data3,data2],axis=1)
data2.drop('Gender',axis=1,inplace=True)

In [65]:
data3=pd.get_dummies(data2['Vehicle_Age'],drop_first=True)
data2=pd.concat([data3,data2],axis=1)
data2.drop('Vehicle_Age',axis=1,inplace=True)

In [66]:
data2['yn']=data2['Age']
for i in range (len(data2)):
    if(data2['Vehicle_Damage'][i]=='No'):
        data2['yn'][i]=0
    else:
        data2['yn'][i]=1

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [67]:
data2.drop('Vehicle_Damage',axis=1,inplace=True)

In [68]:
data2['z']=data2['< 1 Year']
data2['< 1 Year']=data2['id']
data2['id']=data2['z']

In [69]:
data2.rename(columns={'id': 'tempid'}, inplace=True)
data2.rename(columns={'< 1 Year':'id'}, inplace=True)
data2.rename(columns={'tempid':'id'}, inplace=True)
data2.drop('z',axis=1,inplace=True)

In [70]:
data2.head(3)

,id,> 2 Years,Male,AB-,B+,O,id,Age,Driving_License,Previously_Insured,...,8.0,46.0,41.0,15.0,30.0,29.0,50.0,3.0,11.0,yn
0,485035,0,0,0,1,0,0,21,1,0,...,1,0,0,0,0,0,0,0,0,1
1,278306,0,1,0,0,1,0,53,1,0,...,0,0,0,0,0,0,0,0,0,1
2,478061,0,0,0,0,0,1,23,1,1,...,0,0,0,0,1,0,0,0,0,0

In [71]:
data2.to_csv('testingfile.csv')

In [72]:
dt=pd.read_csv('testingfile.csv')

In [73]:
realx=dt.iloc[:,1:26]

In [74]:
sc = StandardScaler()
realx = sc.fit_transform(realx)

In [75]:
actualpred = model.predict(realx)

In [77]:
len(actualpred)

114333

In [76]:
c=0
for i in range(len(actualpred)):
    if(actualpred[i]==1):
        c+=1
print(c)

8417

In [153]:
actualpred = (actualpred > 0.5)

In [133]:
print(actualpred)

numpy.ndarray

In [78]:
dt['accepted']=actualpred

In [140]:
for vari in range (len(dt)):
    if(dt['accepted'][vari]=='FALSE'):
        dt['accepted'][vari]=0
    else:
        dt['accepted'][vari]=1

C:\Users\sunny\anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [79]:
dt.to_csv('LASTFINALSUBMIT.csv')